<template>
	<view>
		<text></text>
		<view>{{context}}</view>
	</view>
</template>

<script>
	export default {
		data() {
			return {
				context:`
				《鲲鹏live直播用户隐私协议 》
				
				特别提示
				
				鲲鹏live服务协议（以下简称“我们”）是鲲鹏live平台（以下简称“鲲鹏”）的开发运营者，我们深知个人信息对您的重要性，并会尽全力保护您个人信息的安全。本隐私政策将向您阐述我们如何收集、使用您的个人信息并帮助您了解您的权利，请在使用我们的服务前，仔细阅读并了解本隐私协议。请尤其注意本隐私协议中加粗、划线的内容并确定了解我们对您个人信息的处理规则。如您有任何疑问，可联系我们的客服进行咨询；如您不同意协议中的任何条款，您应立即停止访问和使用我们的产品。协议最终解释权归鲲鹏数字科技有限公司所有。
				
				本隐私协议主要包含如下内容：
				一、定义
				二、我们如何收集和使用您的个人信息
				三、Cookie和同类技术
				四、您的权利
				五、我们如何保护和保存您的个人信息
				六、本协议如何更新
				七、联系我们
				
				一、定义
				个人信息：指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。
				
				
				二、我们如何收集和使用您的个人信息
				在您使用鲲鹏live软件及服务时，我们会根据合法、正当、必要的原则来收集您的个人信息，并保证仅将收集到的您的个人信息用于提升和改善您的使用体验。
				（一）保障产品的正常基础运行
				当您使用鲲鹏live及相关服务时，为了保障软件与服务的正常运行，我们会收集您的设备型号、操作系统版本号、唯一设备识别符、登录IP地址、接入网络的方式、类型和状态、网络质量数据、操作日志、服务日志、设备MAC地址、存储和电话权限、软件列表信息。请您了解，这些信息是我们提供服务和保障服务正常运行所必须收集的基本信息。
				（二）为您提供音视频、图片文字等内容发布和直播服务
				当您自行发布音视频、图片文字等内容以及享受直播服务时，我们会向您请求授权相机、照片、麦克风权限和设备所在位置信息权限。在此过程中，您可以自行选择是否向我们提供，如果拒绝提供此项授权，将如法使用此项功能，但不影响您使用鲲鹏live的其他功能。
				我们可能为您提供美颜或虚拟形象功能而在客户端本地使用仅供实现该功能效果的部分面部特征值信息，在此过程中，我们不会回传、储存或共享您的任何面部特征值信息。
				（三）其他目的
				在如下情形时，我们会根据法律法规的规定，另行事先征求您的同意：1.我们将信息用于本协议未载明的其他使用目的、用途；2.我们将基于特定使用目的收集而来的信息用于其他使用目时。
				（四）无需征得授权的例外情况
				根据法律法规的规定，在如下情形中收集您的个人信息时无需征得您的授权同意：
				   1. 与国家安全、国防安全有关的；
				   2. 与公共安全、公共卫生、重大公共利益有关的；
				   3. 与犯罪侦查、起诉、审判和判决执行等有关的；
				   4. 出于维护个人信息主体或其他个人的生命、财产等重大合法权益但又很难得到您本人同意的；
				   5. 所收集的个人信息是您自行向社会公众公开的；
				   6. 从合法公开披露的信息中收集个人信息的，如合法的新闻报道、政府信息公开等渠道；
				   7. 根据您的要求签订或履行合同所必需的；
				   8. 用于维护所提供的产品或服务的安全稳定运行所必需的，例如发现、处置产品或服务的故障；
				   9. 为合法的新闻报道所必需的；
				   10. 学术研究机构基于公共利益开展统计或学术研究所必要，且对外提供学术研究或描述的结果时，对结果中所包含的个人信息进行去标识化处理的；
				   11. 法律法规规定的其他情形。
				   
				   
				   三、Cookie和同类技术
				   Cookie和同类技术是互联网中的通用常用技术。为确保花椒平台正常运转、使您获得更轻松的访问体验、向您推荐您可能感兴趣的内容或广告等，我们会在您的移动设备上存储名为Cookie的小数据文件。Cookie通常包含标识符、站点名称以及一些号码和字符。借助于Cookie和同类技术，网站及客户端能够存储您的注册帐号、邮箱、密码（加密）和偏好等数据，省去重复填写个人信息，还可以帮助我们统计流量信息，分析页面设计和广告的有效性。
				   我们不会将Cookie和同类技术用于本协议所述目的之外的任何用途。当然您也可以自行选择清除移动设备上保存的所有Cookie（我的-设置-清理缓存）。
				   
				   
				 四、您的权利
				 （一）访问、更正、删除您的账号信息
				 当您完成帐号的登录并进行必要的身份验证后，您有权通过以下路径自行访问、更正、删除您的账号信息：
				    （1）访问个人信息：点击“我的-头像-个人资料”可查看各基本信息。
				    （2）更正个人信息：点击“我的-头像-个人资料”可更正各基本信息。
				    （3）注销账户：点击“我的-设备管理-注销设备”即可。
					
					
				五、我们如何保护和保存您的个人信息
				（一）技术保护措施
				我们非常重视您个人信息的安全，将努力采取各种符合业界标准的合理的安全措施来保护您的信息，使您的信息不会被泄漏、毁损或者丢失，包括但不限于SSL、隐私信息加密存储、数据中心的访问控制。我们会使用加密技术提高个人信息的安全性；我们会使用受信赖的保护机制防止个人信息遭到恶意攻击；我们会部署访问控制机制，尽力确保只有授权人员才可访问个人信息。
				（二）安全管理体系
				我们有行业先进的以数据为核心，围绕数据生命周期进行的数据安全管理体系，从组织建设、制度设计、人员管理、产品技术、个人信息安全影响评估等方面多维度提升整个系统的安全性。
				我们对可能接触到您的信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。我们会举办安全和隐私保护培训课程，加强员工对于保护个人信息重要性的认识。
				（三）账号保护
				您的账户均有安全保护功能，请妥善保管您的账户及密码信息。如果您发现账号被盗用或个人信息泄露，请及时联系我们，以便我们采取相应措施。
				（四）信息安全事件处理
				尽管有前述安全措施，但同时也请您理解在信息网络上不存在“完善的安全措施”。 如不幸发生个人信息安全事件后，我们将按照法律法规的要求向您告知：安全事件的基本情况和可能的影响、我们已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。事件相关情况我们将以电话、推送通知等方式告知您，难以逐一告知个人信息主体时，我们会采取合理、有效的方式发布公告。同时，我们还将按照监管部门要求，上报个人信息安全事件的处置情况。    
				
				
			六、本协议如何更新
			本隐私协议更新后，鲲鹏live会在您登录及版本更新时以推送通知、弹窗的形式向您展示变更后的隐私协议，以便您及时了解本隐私协议的最新版本。如您继续使用我们的服务，表示同意接受修订后的本协议的内容，但是如果更新的内容需要采集视频、获取通讯录、联系方式、地理位置等个人敏感信息，仍会再次以显著方式征求您的同意。
			对于重大变更，我们还会提供更为显著的通知（我们会通过包括但不限于短信、私信、在登录页面以弹窗做特别提示等方式，说明隐私协议的具体变更内容）。本隐私协议所指的重大变更包括但不限于：
			   1.我们的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息的类型、个人信息的使用方式等；
			   2.个人信息共享、转让或公开披露的主要对象发生变化；
			   3.您参与个人信息处理方面的权利及其行使方式发生重大变化；
			   4.我们负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
			   5.个人信息安全影响评估报告表明存在高风险时。
				   
				   
			七、联系我们
			本隐私协议的成立、生效、履行、解释及纠纷解决，适用中华人民共和国大陆地区法律。
			若您和我们发生任何纠纷或争议，首先应友好协商解决；
			如果您对本隐私协议有任何疑问、意见或建议，您可以通过我的-关于我们-获取我们的联系方式以便联系我们。
			`
			
			
			}
		},
		onReady() {
			//将data存储在本地缓存中指定的key中
			try {
			    uni.setStorageSync('context', this.context);
			} catch (e) {
			    console.log('err'+e)
			}
			//从本地缓存中同步获取指定 key 对应的内容
			try {
			    const value = uni.getStorageSync('context');
			    if (value) {
			        console.log(value);
			    }
			} catch (e) {
			    console.log('err'+e)
			}
		},
		methods: {
			
		}
	}
</script>

<style>

</style>
